podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/USART0_LPC82x.svd.xml
            <register>
               <name>RXDATSTAT</name>
               <description>Receiver Data with Status register. Combines the last character received with the current USART receive status. Allows DMA or software to recover incoming data and status together</description>
               <addressOffset>0x18</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>RXDAT</name>
                     <description>The USART Receiver Data register contains the next received character. The number of bits that are relevant depends on the USART configuration settings</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>FRAMERR</name>
                     <description>Framing Error status flag. This bit is valid when there is a character to be read in the RXDAT register and reflects the status of that character. This bit will set when the character in RXDAT was received with a missing stop bit at the expected location. This could be an indication of a baud rate or configuration mismatch with the transmitting source</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PARITYERR</name>
                     <description>Parity Error status flag. This bit is valid when there is a character to be read in the RXDAT register and reflects the status of that character. This bit will be set when a parity error is detected in a received character</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXNOISE</name>
                     <description>Received Noise flag. See description of the RXNOISEINT bit in Table 177</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXDAT</name>
               <description>Transmit Data register. Data to be transmitted is written here</description>
               <addressOffset>0x1C</addressOffset>
               <fields>
                  <field>
                     <name>TXDAT</name>
                     <description>Writing to the USART Transmit Data Register causes the data to be transmitted as soon as the transmit shift register is available and any conditions for transmitting data are met: CTS low (if CTSEN bit = 1), TXDIS bit = 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BRG</name>
               <description>Baud Rate Generator register. 16-bit integer baud rate divisor value</description>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>BRGVAL</name>
                     <description>This value is used to divide the USART input clock to determine the baud rate, based on the input clock from the FRG. 0 = The FRG clock is used directly by the USART function. 1 = The FRG clock is divided by 2 before use by the USART function. 2 = The FRG clock is divided by 3 before use by the USART function. ... 0xFFFF = The FRG clock is divided by 65,536 before use by the USART function</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTSTAT</name>
               <description>Interrupt status register. Reflects interrupts that are currently enabled</description>
               <addressOffset>0x24</addressOffset>
               <access>read-only</access>
               <resetValue>0x5</resetValue>
               <fields>
                  <field>
                     <name>RXRDY</name>
                     <description>Receiver Ready flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXRDY</name>
                     <description>Transmitter Ready flag</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXIDLE</name>
                     <description>Transmitter idle status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DELTACTS</name>
                     <description>This bit is set when a change in the state of the CTS input is detected</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXDISINT</name>
                     <description>Transmitter Disabled Interrupt flag</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVERRUNINT</name>
                     <description>Overrun Error interrupt flag</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DELTARXBRK</name>
                     <description>This bit is set when a change in the state of receiver break detection occurs</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>START</name>
                     <description>This bit is set when a start is detected on the receiver input</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRAMERRINT</name>
                     <description>Framing Error interrupt flag</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PARITYERRINT</name>
                     <description>Parity Error interrupt flag</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXNOISEINT</name>
                     <description>Received Noise interrupt flag</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ABERR</name>
                     <description>Autobaud Error flag</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OSR</name>
               <description>Oversample selection register for asynchronous communication</description>
               <addressOffset>0x28</addressOffset>
               <resetValue>0xF</resetValue>
               <fields>
                  <field>
                     <name>OSRVAL</name>
                     <description>Oversample Selection Value. 0 to 3 = not supported 0x4 = 5 peripheral clocks are used to transmit and receive each data bit. 0x5 = 6 peripheral clocks are used to transmit and receive each data bit.  ... 0xF= 16 peripheral clocks are used to transmit and receive each data bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADDR</name>
               <description>Address register for automatic address matching</description>
               <addressOffset>0x2C</addressOffset>
               <fields>
                  <field>
                     <name>ADDRESS</name>
                     <description>8-bit address used with automatic address matching. Used when address detection is enabled (ADDRDET in CTL = 1) and automatic address matching is enabled (AUTOADDR in CFG = 1)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
